SpenceKonde/megaTinyCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#                       ########                 #####                   #
#                          ##                   ##```                    #
#  #   # ####  ###   ##    ##   ### #   # #   # ##      ###  ####  ####  #
#  ## ## #    #     #  #   ##    #  ##  #  # #  ##     #   # #   # #     #
#  # # # ###  #  ## ####   ##    #  # # #   #   ##     #   # ####  ###   #
#  #   # #    #   # #  #   ##    #  #  ##   #   ##___  #   # # #   #     #
#  #   # ####  ###  #  #   ##   ### #   #   #    #####  ###  #  #  ####  #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other             ##       #  #      ###   #
#  contributors 2018-2021                      #  #      #  #     #   #  #
#  megaTinyCore is free software.        # #     #       ####     # # #  #
#  (LGPL v2.1) see LICENSE.md and        # #    #    ##     #  ## #   #  #
#  License section of README.md           #    ####  ##     #  ##  ###   #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition. Optiboot sections have a     #
#  line inside the right edge if they are for the 2-series parts.        #
#                                                                        #
##########################################################################
#                                                                        #
#          ###  #   #  ####   #   #  ####  #   #  #   #   ###            #
#         #     #   #  #   #  ## ##  #     ##  #  #   #  #               #
#          ###  #   #  ####   # # #  ###   # # #  #   #   ###            #
#             # #   #  #   #  #   #  #     #  ##  #   #      #           #
#          ###   ###   ####   #   #  ####  #   #   ###    ###            #
#________________________________________________________________________#
# The *opti menus are for Optiboot board definitions - We name them
# differently when the option takes on different meaning for a bootloaded
# board. Eg - UPDI can set fuses, so OSCCFG is set on all uploads and
# you don't need to burn bootloader to change clock speed.

menu.chip=Chip or Board
menu.clock=Clock (burn bootloader NOT req'd)
menu.clocko=Clock (burn bootloader req'd, or see docs)
menu.millis=millis()/micros() Timer
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (burn bootloader req'd)
menu.bodvoltage=BOD Voltage Level (burn bootloader req'd)
menu.bodmode=BOD Mode when Active/Sleeping (burn bootloader req'd)
menu.eesave=Save EEPROM (burn bootloader req'd)
menu.bootloaderuart=UART for Bootloader (burn bootloader req'd)
menu.resetpin=UPDI/Reset Pin Function (burn bootloader req'd)
menu.resetpinopti=UPDI/Reset Pin and Optiboot Entry (burn bootloader req'd)
menu.resetpinopti_2=UPDI/alt-RST pins and Optiboot Entry (burn bootloader req'd)
menu.uartvoltage=Voltage Baud Correction

##########################################################################
#                                                                        #
###              ####    ###    ###   ####   ####    ###               ###
#####            #   #  #   #  #   #  #   #  #   #  #                #####
#######          ####   #   #  #####  ####   #   #   ###           #######
#####            #   #  #   #  #   #  #  #   #   #      #            #####
###              ####    ###   #   #  #   #  ####    ###               ###
#________________________________________________________________________#
##########################################################################
# Names listed at the top so they can be kept in consistent format

atxy7.name=ATtiny3227/3217/1627/1617/1607/827/817/807/427/417
atxy6.name=ATtiny3226/3216/1626/1616/1606/826/816/806/426/416/406
atxy4.name=ATtiny3224/1624/1614/1604/824/814/804/424/414/404/214/204
atxy2.name=ATtiny412/402/212/202
atxy7o.name=ATtiny3217/1617/1607/817/807/417 w/Optiboot
atx27o.name=ATtiny3227/1627/827/427 w/Optiboot
atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 w/Optiboot
atx26o.name=ATtiny3226/1627/826/426 w/Optiboot
atxy4o.name=ATtiny1614/1604/814/804/414/404 w/Optiboot
atx24o.name=ATtiny3224/1624/824/424 w/Optiboot
atxy2o.name=ATtiny412/402/212/202 w/Optiboot

##########################################################################
#  Non-bootloader                                                        #
#                                ##   #  #     ####   ###  #   #       ###
#  ATtiny3227/3217              #  #  #  #     #   #   #   ##  #     #####
#  ATtiny1627/1617/1607           #   #### === ####    #   # # #   #######
#  ATtiny827/817/807             #       #     #       #   #  ##     #####
#  ATtiny427/417/407            ####     #     #      ###  #   #       ###
#________________________________________________________________________#

### BUILD PARAMETERS
atxy7.build.text_section_start=.text=0x0
atxy7.build.millistimer=D0
atxy7.build.bootload=
atxy7.build.board=AVR_ATtinyxy7
atxy7.build.clocksource=0
atxy7.build.core=megatinycore
atxy7.build.variant=txy7
atxy7.build.mcu=attiny{build.attiny}
atxy7.build.f_cpu={build.speed}000000L
atxy7.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage}
atxy7.build.export_merged_output=false

### BOOTLOADING PARAMETERS (FUSES)
atxy7.bootloader.WDTCFG=0x00
atxy7.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7.bootloader.OSCCFG=0x01
atxy7.bootloader.TCD0CFG=0x00
atxy7.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy7.bootloader.APPEND=0x00
atxy7.bootloader.BOOTEND=0x00
atxy7.bootloader.tool=avrdude
atxy7.bootloader.avrdudestring=
atxy7.bootloader.pymcuprogstring=-aerase

### ALL UPLOADING VIA UPDI
atxy7.upload.tool=avrdude
atxy7.upload.workaround=

### CHIP
atxy7.menu.chip.3217=ATtiny3217
atxy7.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7.menu.chip.3217.build.attiny=3217
atxy7.menu.chip.3217.upload.maximum_size=32768
atxy7.menu.chip.3217.upload.maximum_data_size=2048
atxy7.menu.chip.1617=ATtiny1617
atxy7.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7.menu.chip.1617.build.attiny=1617
atxy7.menu.chip.1617.upload.maximum_size=16384
atxy7.menu.chip.1617.upload.maximum_data_size=2048
atxy7.menu.chip.817=ATtiny817
atxy7.menu.chip.817.build.board=AVR_ATtiny817
atxy7.menu.chip.817.build.attiny=817
atxy7.menu.chip.817.upload.maximum_size=8192
atxy7.menu.chip.817.upload.maximum_data_size=512
atxy7.menu.chip.417=ATtiny417
atxy7.menu.chip.417.build.board=AVR_ATtiny417
atxy7.menu.chip.417.build.attiny=417
atxy7.menu.chip.417.upload.maximum_size=4096
atxy7.menu.chip.417.upload.maximum_data_size=256
atxy7.menu.chip.3227=ATtiny3227
atxy7.menu.chip.3227.bootloader.altreset=11
atxy7.menu.chip.3227.build.board=AVR_ATtiny3227
atxy7.menu.chip.3227.build.millistimer=B1
atxy7.menu.chip.3227.build.attiny=3227
atxy7.menu.chip.3227.upload.maximum_size=32768
atxy7.menu.chip.3227.upload.maximum_data_size=3072
atxy7.menu.chip.1627=ATtiny1627
atxy7.menu.chip.1627.bootloader.altreset=11
atxy7.menu.chip.1627.build.board=AVR_ATtiny1627
atxy7.menu.chip.1627.build.millistimer=B1
atxy7.menu.chip.1627.build.attiny=1627
atxy7.menu.chip.1627.upload.maximum_size=16384
atxy7.menu.chip.1627.upload.maximum_data_size=2048
atxy7.menu.chip.827=ATtiny827
atxy7.menu.chip.827.bootloader.altreset=11
atxy7.menu.chip.827.build.board=AVR_ATtiny827
atxy7.menu.chip.827.build.millistimer=B1
atxy7.menu.chip.827.build.attiny=827
atxy7.menu.chip.827.upload.maximum_size=8192
atxy7.menu.chip.827.upload.maximum_data_size=1024
atxy7.menu.chip.427=ATtiny427
atxy7.menu.chip.427.bootloader.altreset=11
atxy7.menu.chip.427.build.board=AVR_ATtiny427
atxy7.menu.chip.427.build.millistimer=B1
atxy7.menu.chip.427.build.attiny=427
atxy7.menu.chip.427.upload.maximum_size=4096
atxy7.menu.chip.427.upload.maximum_data_size=512
atxy7.menu.chip.1607=ATtiny1607
atxy7.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7.menu.chip.1607.build.attiny=1607
atxy7.menu.chip.1607.build.millistimer=A0
atxy7.menu.chip.1607.upload.maximum_size=16384
atxy7.menu.chip.1607.upload.maximum_data_size=1024
atxy7.menu.chip.807=ATtiny807
atxy7.menu.chip.807.build.board=AVR_ATtiny807
atxy7.menu.chip.807.build.attiny=807
atxy7.menu.chip.807.build.millistimer=A0
atxy7.menu.chip.807.upload.maximum_size=8192
atxy7.menu.chip.807.upload.maximum_data_size=512

### CLOCK SOURCE
atxy7.menu.clock.20internal=20 MHz internal
atxy7.menu.clock.16internal=16 MHz internal
atxy7.menu.clock.10internal=10 MHz internal
atxy7.menu.clock.8internal=8 MHz internal
atxy7.menu.clock.5internal=5 MHz internal
atxy7.menu.clock.4internal=4 MHz internal
atxy7.menu.clock.1internal=1 MHz internal
atxy7.menu.clock.20extclock=20 MHz external clock
atxy7.menu.clock.16extclock=16 MHz external clock
atxy7.menu.clock.12extclock=12 MHz external clock
atxy7.menu.clock.10extclock=10 MHz external clock
atxy7.menu.clock.8extclock=8 MHz external clock
atxy7.menu.clock.24extclock=24 MHz external clock (overclocked)
atxy7.menu.clock.28extclock=28 MHz external clock (overclocked)
atxy7.menu.clock.32extclock=32 MHz external clock (overclocked)
atxy7.menu.clock.20internal.build.speed=20
atxy7.menu.clock.20internal.build.clocksource=0
atxy7.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.16internal.build.speed=16
atxy7.menu.clock.16internal.build.clocksource=0
atxy7.menu.clock.10internal.build.speed=10
atxy7.menu.clock.10internal.build.clocksource=0
atxy7.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.8internal.build.speed=8
atxy7.menu.clock.8internal.build.clocksource=0
atxy7.menu.clock.5internal.build.speed=5
atxy7.menu.clock.5internal.build.clocksource=0
atxy7.menu.clock.5internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.4internal.build.speed=4
atxy7.menu.clock.4internal.build.clocksource=0
atxy7.menu.clock.1internal.build.speed=1
atxy7.menu.clock.1internal.build.clocksource=0
atxy7.menu.clock.20extclock.build.speed=20
atxy7.menu.clock.20extclock.build.clocksource=2
atxy7.menu.clock.16extclock.build.speed=16
atxy7.menu.clock.16extclock.build.clocksource=2
atxy7.menu.clock.12extclock.build.speed=12
atxy7.menu.clock.12extclock.build.clocksource=2
atxy7.menu.clock.10extclock.build.speed=10
atxy7.menu.clock.10extclock.build.clocksource=2
atxy7.menu.clock.8extclock.build.speed=8
atxy7.menu.clock.8extclock.build.clocksource=2
atxy7.menu.clock.24extclock.build.speed=24
atxy7.menu.clock.24extclock.build.clocksource=2
atxy7.menu.clock.28extclock.build.speed=28
atxy7.menu.clock.28extclock.build.clocksource=2
atxy7.menu.clock.32extclock.build.speed=32
atxy7.menu.clock.32extclock.build.clocksource=2

### BOD VOLTAGE
atxy7.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7.menu.bodvoltage.2v1=2.1V
atxy7.menu.bodvoltage.2v9=2.9V
atxy7.menu.bodvoltage.3v3=3.3V
atxy7.menu.bodvoltage.3v7=3.7V
atxy7.menu.bodvoltage.4v0=4.0V
atxy7.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7.menu.bodvoltage.2v1.bootloader.bodlevbits=001

