SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy2.menu.bodmode.disabled=Disabled/Disabled
atxy2.menu.bodmode.enabled=Enabled/Enabled
atxy2.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### EEPROM RETAIN
atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.eesavebit=1
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.eesavebit=0

### MILLIS TIMER
atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.disabled.build.millistimer=NONE
atxy2.menu.millis.timera.build.millistimer=A0
atxy2.menu.millis.timerd.build.millistimer=D0
atxy2.menu.millis.timerb0.build.millistimer=B0
atxy2.menu.millis.rtc.build.millistimer=RTC

### UPDI/RESET PIN CONFIGURATION
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy2.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy2.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy2.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy2.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy2.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy2.menu.resetpin.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy2.menu.startuptime.8=8ms
atxy2.menu.startuptime.0=0ms
atxy2.menu.startuptime.1=1ms
atxy2.menu.startuptime.2=2ms
atxy2.menu.startuptime.4=4ms
atxy2.menu.startuptime.16=16ms
atxy2.menu.startuptime.32=32ms
atxy2.menu.startuptime.64=64ms
atxy2.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy2.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy2.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy2.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy2.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy2.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy2.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy2.menu.startuptime.64.bootloader.SYSCFG1=0x07

### VOLTAGE FOR UART BAUD CORRECTION
atxy2.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy2.menu.uartvoltage.skip.build.uartvoltage=NA
atxy2.menu.uartvoltage.5v=Closer to 5v
atxy2.menu.uartvoltage.3v=Closer to 3v
atxy2.menu.uartvoltage.5v.build.uartvoltage=5V
atxy2.menu.uartvoltage.3v.build.uartvoltage=3V

##########################################################################
##########################################################################
#                                                                        #
#           ###   ####   #####  ###  ####    ###    ###   #####          #
#          #   #  #   #    #     #   #   #  #   #  #   #    #            #
#          #   #  ####     #     #   ####   #   #  #   #    #            #
#          #   #  #        #     #   #   #  #   #  #   #    #            #
#           ###   #        #    ###  ####    ###    ###     #            #
#________________________________________________________________________#
##########################################################################

##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    ##   #  #     ####   ###  #   #         #
#                               #  #  #  #     #   #   #   ##  #         #
#  ATtiny3217/1617                #   #### === ####    #   # # #         #
#  ATtiny1607/817                #       #     #       #   #  ##         #
#  ATtiny807/417                ####     #     #      ###  #   #         #
#________________________________________________________________________#

### BUILD PARAMETERS
atxy7o.build.text_section_start=.text=0x200
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.clocksource=0
atxy7o.build.core=megatinycore
atxy7o.build.variant=txy7
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DUSING_OPTIBOOT
atxy7o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7o.bootloader.OSCCFG=0x01
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02
atxy7o.bootloader.tool=avrdude
atxy7o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy7o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy7o.upload.workaround=
atxy7o.upload.tool=avrdude
atxy7o.upload.speed=115200
atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D

### CHIP
atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=AVR_ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=AVR_ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=AVR_ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

### CLOCK SOURCE
atxy7o.menu.clocko.20internal=20 MHz internal
atxy7o.menu.clocko.16internal=16 MHz internal
atxy7o.menu.clocko.10internal=10 MHz internal
atxy7o.menu.clocko.8internal=8 MHz internal
atxy7o.menu.clocko.5internal=5 MHz internal
atxy7o.menu.clocko.4internal=4 MHz internal
atxy7o.menu.clocko.1internal=1 MHz internal
atxy7o.menu.clocko.20extclock=20 MHz external clock
atxy7o.menu.clocko.16extclock=16 MHz external clock
atxy7o.menu.clocko.12extclock=12 MHz external clock
atxy7o.menu.clocko.10extclock=10 MHz external clock
atxy7o.menu.clocko.8extclock=8 MHz external clock
atxy7o.menu.clocko.24extclock=24 MHz external clock (overclocked)
atxy7o.menu.clocko.28extclock=28 MHz external clock (overclocked)
atxy7o.menu.clocko.32extclock=32 MHz external clock (overclocked)
atxy7o.menu.clocko.20internal.build.speed=20
atxy7o.menu.clocko.20internal.build.clocksource=0
atxy7o.menu.clocko.16internal.build.speed=16
atxy7o.menu.clocko.16internal.build.clocksource=0
atxy7o.menu.clocko.10internal.build.speed=10
atxy7o.menu.clocko.10internal.build.clocksource=0
atxy7o.menu.clocko.8internal.build.speed=8
atxy7o.menu.clocko.8internal.build.clocksource=0
atxy7o.menu.clocko.5internal.build.speed=5
atxy7o.menu.clocko.5internal.build.clocksource=0
atxy7o.menu.clocko.4internal.build.speed=4
atxy7o.menu.clocko.4internal.build.clocksource=0
atxy7o.menu.clocko.1internal.build.speed=1
atxy7o.menu.clocko.1internal.build.clocksource=0
atxy7o.menu.clocko.20extclock.build.speed=20
atxy7o.menu.clocko.20extclock.build.clocksource=2
atxy7o.menu.clocko.16extclock.build.speed=16
atxy7o.menu.clocko.16extclock.build.clocksource=2
atxy7o.menu.clocko.12extclock.build.speed=12
atxy7o.menu.clocko.12extclock.build.clocksource=2
atxy7o.menu.clocko.10extclock.build.speed=10
atxy7o.menu.clocko.10extclock.build.clocksource=2
atxy7o.menu.clocko.8extclock.build.speed=8
atxy7o.menu.clocko.8extclock.build.clocksource=2
atxy7o.menu.clocko.24extclock.build.speed=24
atxy7o.menu.clocko.24extclock.build.clocksource=2
atxy7o.menu.clocko.28extclock.build.speed=28
atxy7o.menu.clocko.28extclock.build.clocksource=2
atxy7o.menu.clocko.32extclock.build.speed=32
atxy7o.menu.clocko.32extclock.build.clocksource=2
atxy7o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### BOD VOLTAGE
atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V
atxy7o.menu.bodvoltage.2v9=2.9V
atxy7o.menu.bodvoltage.3v3=3.3V
atxy7o.menu.bodvoltage.3v7=3.7V
atxy7o.menu.bodvoltage.4v0=4.0V
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

