SpenceKonde/megaTinyCore/megaavr/boards.txt
##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    #    #  #     ####   ###  #   #         #
#                               ##    #  #     #   #   #   ##  #         #
#  ATtiny1614/1604               #    #### === ####    #   # # #         #
#  ATtiny814/804/414             #       #     #       #   #  ##         #
#  ATtiny404/214/204            ###      #     #      ###  #   #         #
#________________________________________________________________________#

### BUILD PARAMETERS
atxy4o.build.text_section_start=.text=0x200
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.board=AVR_ATtinyxy4
atxy4o.build.clocksource=0
atxy4o.build.core=megatinycore
atxy4o.build.variant=txy4
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DUSING_OPTIBOOT
atxy4o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02
atxy4o.bootloader.tool=avrdude
atxy4o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy4o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy4o.upload.workaround=
atxy4o.upload.tool=avrdude
atxy4o.upload.speed=115200
atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D

### CHIP
atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4o.menu.chip.1614.build.attiny=1614
atxy4o.menu.chip.1614.upload.maximum_size=15872
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4o.menu.chip.1604.build.attiny=1604
atxy4o.menu.chip.1604.build.millistimer=A0
atxy4o.menu.chip.1604.upload.maximum_size=15872
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.board=AVR_ATtiny814
atxy4o.menu.chip.814.build.attiny=814
atxy4o.menu.chip.814.upload.maximum_size=7680
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.board=AVR_ATtiny804
atxy4o.menu.chip.804.build.attiny=804
atxy4o.menu.chip.804.build.millistimer=A0
atxy4o.menu.chip.804.upload.maximum_size=7680
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.board=AVR_ATtiny414
atxy4o.menu.chip.414.build.attiny=414
atxy4o.menu.chip.414.upload.maximum_size=3584
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.board=AVR_ATtiny404
atxy4o.menu.chip.404.build.attiny=404
atxy4o.menu.chip.404.build.millistimer=A0
atxy4o.menu.chip.404.upload.maximum_size=3584
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.board=AVR_ATtiny214
atxy4o.menu.chip.214.build.attiny=214
atxy4o.menu.chip.214.upload.maximum_size=1536
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.board=AVR_ATtiny204
atxy4o.menu.chip.204.build.attiny=204
atxy4o.menu.chip.204.build.millistimer=A0
atxy4o.menu.chip.204.upload.maximum_size=1536
atxy4o.menu.chip.204.upload.maximum_data_size=128

### CLOCK SOURCE
atxy4o.menu.clocko.20internal=20 MHz internal
atxy4o.menu.clocko.16internal=16 MHz internal
atxy4o.menu.clocko.10internal=10 MHz internal
atxy4o.menu.clocko.8internal=8 MHz internal
atxy4o.menu.clocko.5internal=5 MHz internal
atxy4o.menu.clocko.4internal=4 MHz internal
atxy4o.menu.clocko.1internal=1 MHz internal
atxy4o.menu.clocko.20extclock=20 MHz external clock
atxy4o.menu.clocko.16extclock=16 MHz external clock
atxy4o.menu.clocko.12extclock=12 MHz external clock
atxy4o.menu.clocko.10extclock=10 MHz external clock
atxy4o.menu.clocko.8extclock=8 MHz external clock
atxy4o.menu.clocko.24extclock=24 MHz external clock (overclocked)
atxy4o.menu.clocko.28extclock=28 MHz external clock (overclocked)
atxy4o.menu.clocko.32extclock=32 MHz external clock (overclocked)
atxy4o.menu.clocko.20internal.build.speed=20
atxy4o.menu.clocko.20internal.build.clocksource=0
atxy4o.menu.clocko.16internal.build.speed=16
atxy4o.menu.clocko.16internal.build.clocksource=0
atxy4o.menu.clocko.10internal.build.speed=10
atxy4o.menu.clocko.10internal.build.clocksource=0
atxy4o.menu.clocko.8internal.build.speed=8
atxy4o.menu.clocko.8internal.build.clocksource=0
atxy4o.menu.clocko.5internal.build.speed=5
atxy4o.menu.clocko.5internal.build.clocksource=0
atxy4o.menu.clocko.4internal.build.speed=4
atxy4o.menu.clocko.4internal.build.clocksource=0
atxy4o.menu.clocko.1internal.build.speed=1
atxy4o.menu.clocko.1internal.build.clocksource=0
atxy4o.menu.clocko.20extclock.build.speed=20
atxy4o.menu.clocko.20extclock.build.clocksource=2
atxy4o.menu.clocko.16extclock.build.speed=16
atxy4o.menu.clocko.16extclock.build.clocksource=2
atxy4o.menu.clocko.12extclock.build.speed=12
atxy4o.menu.clocko.12extclock.build.clocksource=2
atxy4o.menu.clocko.10extclock.build.speed=10
atxy4o.menu.clocko.10extclock.build.clocksource=2
atxy4o.menu.clocko.8extclock.build.speed=8
atxy4o.menu.clocko.8extclock.build.clocksource=2
atxy4o.menu.clocko.24extclock.build.speed=24
atxy4o.menu.clocko.24extclock.build.clocksource=2
atxy4o.menu.clocko.28extclock.build.speed=28
atxy4o.menu.clocko.28extclock.build.clocksource=2
atxy4o.menu.clocko.32extclock.build.speed=32
atxy4o.menu.clocko.32extclock.build.clocksource=2
atxy4o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atxy4o.menu.millis.enabled=Enabled (default timer)
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.timera=TCA0 (default on 0-series)
atxy4o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4o.menu.millis.timerb1=TCB1 (1614 only)
atxy4o.menu.millis.rtc=RTC (no micros)
atxy4o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1-series only, no micros)
atxy4o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1-series only, no micros)
atxy4o.menu.millis.disabled.build.millistimer=NONE
atxy4o.menu.millis.timera.build.millistimer=A0
atxy4o.menu.millis.timerd.build.millistimer=D0
atxy4o.menu.millis.timerb0.build.millistimer=B0
atxy4o.menu.millis.timerb1.build.millistimer=B1
atxy4o.menu.millis.rtc.build.millistimer=RTC
atxy4o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### BOD VOLTAGE
atxy4o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4o.menu.bodvoltage.2v1=2.1V
atxy4o.menu.bodvoltage.2v9=2.9V
atxy4o.menu.bodvoltage.3v3=3.3V
atxy4o.menu.bodvoltage.3v7=3.7V
atxy4o.menu.bodvoltage.4v0=4.0V
atxy4o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy4o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

