SpenceKonde/megaTinyCore/megaavr/boards.txt
### CLOCK SOURCE
atxy2o.menu.clocko.20internal=20 MHz internal
atxy2o.menu.clocko.16internal=16 MHz internal
atxy2o.menu.clocko.10internal=10 MHz internal
atxy2o.menu.clocko.8internal=8 MHz internal
atxy2o.menu.clocko.5internal=5 MHz internal
atxy2o.menu.clocko.4internal=4 MHz internal
atxy2o.menu.clocko.1internal=1 MHz internal
atxy2o.menu.clocko.20extclock=20 MHz external clock
atxy2o.menu.clocko.16extclock=16 MHz external clock
atxy2o.menu.clocko.12extclock=12 MHz external clock
atxy2o.menu.clocko.10extclock=10 MHz external clock
atxy2o.menu.clocko.8extclock=8 MHz external clock
atxy2o.menu.clocko.24extclock=24 MHz external clock (overclocked)
atxy2o.menu.clocko.28extclock=28 MHz external clock (overclocked)
atxy2o.menu.clocko.32extclock=32 MHz external clock (overclocked)
atxy2o.menu.clocko.20internal.build.speed=20
atxy2o.menu.clocko.20internal.build.clocksource=0
atxy2o.menu.clocko.16internal.build.speed=16
atxy2o.menu.clocko.16internal.build.clocksource=0
atxy2o.menu.clocko.10internal.build.speed=10
atxy2o.menu.clocko.10internal.build.clocksource=0
atxy2o.menu.clocko.8internal.build.speed=8
atxy2o.menu.clocko.8internal.build.clocksource=0
atxy2o.menu.clocko.5internal.build.speed=5
atxy2o.menu.clocko.5internal.build.clocksource=0
atxy2o.menu.clocko.4internal.build.speed=4
atxy2o.menu.clocko.4internal.build.clocksource=0
atxy2o.menu.clocko.1internal.build.speed=1
atxy2o.menu.clocko.1internal.build.clocksource=0
atxy2o.menu.clocko.20extclock.build.speed=20
atxy2o.menu.clocko.20extclock.build.clocksource=2
atxy2o.menu.clocko.16extclock.build.speed=16
atxy2o.menu.clocko.16extclock.build.clocksource=2
atxy2o.menu.clocko.12extclock.build.speed=12
atxy2o.menu.clocko.12extclock.build.clocksource=2
atxy2o.menu.clocko.10extclock.build.speed=10
atxy2o.menu.clocko.10extclock.build.clocksource=2
atxy2o.menu.clocko.8extclock.build.speed=8
atxy2o.menu.clocko.8extclock.build.clocksource=2
atxy2o.menu.clocko.24extclock.build.speed=24
atxy2o.menu.clocko.24extclock.build.clocksource=2
atxy2o.menu.clocko.28extclock.build.speed=28
atxy2o.menu.clocko.28extclock.build.clocksource=2
atxy2o.menu.clocko.32extclock.build.speed=32
atxy2o.menu.clocko.32extclock.build.clocksource=2
atxy2o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atxy2o.menu.millis.enabled=Enabled (default timer)
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.timera=TCA0 (default on 402/202)
atxy2o.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2o.menu.millis.rtc=RTC (no micros)
atxy2o.menu.millis.disabled.build.millistimer=NONE
atxy2o.menu.millis.timera.build.millistimer=A0
atxy2o.menu.millis.timerd.build.millistimer=D0
atxy2o.menu.millis.timerb0.build.millistimer=B0
atxy2o.menu.millis.rtc.build.millistimer=RTC

### BOD VOLTAGE
atxy2o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2o.menu.bodvoltage.2v1=2.1V
atxy2o.menu.bodvoltage.2v9=2.9V
atxy2o.menu.bodvoltage.3v3=3.3V
atxy2o.menu.bodvoltage.3v7=3.7V
atxy2o.menu.bodvoltage.4v0=4.0V
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

### BOD MODE
atxy2o.menu.bodmode.disabled=Disabled/Disabled
atxy2o.menu.bodmode.enabled=Enabled/Enabled
atxy2o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### BOOTLOADER UART PINS
# Weird thing - non-alt-0pin bootloaders for 2-series are separate binaries because of LED pin
# But when altgernate pins are used, it can use the same binary as all other 0/1-series!
atxy2o.menu.bootloaderuart.default=TX:0 (PA6), RX:1 (PA7)
atxy2o.menu.bootloaderuart.alternate=TX:2 (PA1), RX:3 (PA2)
atxy2o.menu.bootloaderuart.default.bootloader.uartswap=2
atxy2o.menu.bootloaderuart.alternate.bootloader.uartswap=z_alt

### VOLTAGE FOR UART BAUD CORRECTION
atxy2o.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy2o.menu.uartvoltage.skip.build.uartvoltage=NA
atxy2o.menu.uartvoltage.5v=Closer to 5v
atxy2o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy2o.menu.uartvoltage.3v=Closer to 3v
atxy2o.menu.uartvoltage.3v.build.uartvoltage=3V

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
atxy2o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txy{bootloader.uartswap}_1sec.hex
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy2o.menu.resetpinopti.reset.bootloader.file=optiboot_txy{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy2o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy2o.menu.resetpinopti.gpio.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy2o.menu.startuptimeopti.8=8ms
atxy2o.menu.startuptimeopti.0=0ms
atxy2o.menu.startuptimeopti.1=1ms
atxy2o.menu.startuptimeopti.2=2ms
atxy2o.menu.startuptimeopti.4=4ms
atxy2o.menu.startuptimeopti.16=16ms
atxy2o.menu.startuptimeopti.32=32ms
atxy2o.menu.startuptimeopti.64=64ms
atxy2o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy2o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy2o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy2o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy2o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy2o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy2o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy2o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07
